app/controllers/users_controller.rb

INSERT INTO "users" ("first", "last", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first", "fd"], ["last", "fdf"], ["created_at", "2023-01-12 13:34:42.929870"], ["updated_at", "2023-01-12 13:34:42.929870"]]
---
  def create
    @user = Datum.new(user_params)
    if @user.save